<?php

use Illuminate\Database\Seeder;
use App\Article;

class ArticlesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Article::create([
            'article_name' => 'Microchip',
            'article_content' => 'ไมโครชิพคือ ชิ้นส่วนอิเล็กทรอนิกส์ หรือเรียกกันว่า แก้วดาวเทียม ซึ่งบรรจุอยู่ในครอบแก้วที่ผ่านกระบวนการฆ่าเชื้อด่วนแก๊ส Ethylene Oxide โดยใช้เข็มที่บรรจุไมโครชิพอยู่ภายในและถูกทำให้ปลอดเชื้อ สามารถฉีดเข้าไปใต้ผิวหนังของสัตว์เลี้ยงของท่านได้เลย โดยการติดตั้งสามารถให้คลินิคสำหรับสัตว์เลี้ยงทำการติดตั้ง และไมโครชิพของเราได้รับมาตรฐาน ISO 11784-11785 จนได้รับความเชื่อมั่นว่าจะไม่ทำปฎิกิริยากับเนื้อเยื่อผิวหนังของสัตว์เลี้ยงซึ่งสัตว์เลี้ยงของท่านจะมีรหัสถาวรสำหรับฝั่งภายใต้ผิวหนัง หมายเลขภายในไมโครชิพจะถูกกำหนดไว้แล้วจากโรงงานผู้ผลิต จึงไม่สามารถเปลี่ยนแปลงหมายเลขนั้นๆ ได้ หมายเลขไม่มีการซ้ำกัน และการอ่านหมายเลขก็ต้องใช้เครื่องอ่านไมโครชิพ (Microchip Reader) เป็นตัวแสดงผล เป็นต้น',
            'article_image' => 'article1.jpg',
        ]);

        Article::create([
            'article_name' => 'ไมโครชิพได้รับการยอมรับ',
            'article_content' => 'รหัสไมโครชิพที่ได้มาตรฐานนั้นจะต้องได้รับการรับรองจาก ISO และ ICAR ซึ่งรหัสและหมายเลขของไมโครชิพ จะต้องมีด้วยกัน 15 หลัก และ เป็นไปตามมาตรฐานของ ISO 11784/11785 โดย 3 หลักแรกจะระบุถึงประเทศ หรือ บริษัทที่เป็นเจ้าของ ซึ่งแต่ละประเทศจะใช้รหัสที่แตกต่างกันไป แต่ในขณะนี้ยังไม่มีหน่วยงานราชการใดรับผิดชอบ ดังนั้นจึงจำเป็นต้องใช้หมายเลข 3 หลักแรก เป็นรหัสของบริษัทผู้ผลิตที่ได้ทำการขึ้นทะเบียนอย่างถูกต้องไว้กับ ICAR (ICAR เป็นหน่วยงานกลางที่ควบคุมการออกหมายเลขไมโครชิพ) ไปก่อน เพื่อไม่ให้หมายเลขไมโครชิพออกมาซ้ำกัน ในปัจจุบันรหัสเริ่มต้นของ ESRA PET SALE THAILAND คือ 900.079 XXX XXX XXX',
            'article_image' => 'article2.jpg',
        ]);

        Article::create([
            'article_name' => 'ประโยชน์ของไมโครชิพ',
            'article_content' => 'เพื่อป้องกันสัตว์เลี้ยงของท่านหาย หากมีผู้พบเจอสัตว์เลี้ยงของท่านสามารถนำมาให้ศูนย์ติดตั้งไมโครชิพที่มีอยู่ทั่วไปให้ทำการตรวจสอบหมายเลขประจำตัว ซึ่งสามารถตรวจสอบหาเจ้าของได้จากระบบฐานข้อมูลที่ได้มีการจัดเก็บบันทึกข้อมูลเกี่ยวกับสัตว์เลี้ยง อาธิ ที่อยู่ของเจ้าของ สายพันธุ์สัตว์เลี้ยง สี เพศ อายุ ที่ระบบได้จัดเก็บข้อมูลไว้ ทำให้สัตว์เลี้ยงได้ถูกส่งกลับบ้านอย่างปลอดถัย หรือหากมีผู้ที่จับเอาสัตว์เลี้ยงของท่านไปอุปการะไม่ยอมคืนให้เจ้าของ ท่านสามารถยืนยันตัวตนความเป็นเจ้าของได้จากใบรับรอองการติดตั้งบัตรประจำตัวสัตว์เลี้ยงอิเล็กทรอนิกส์ซึ่งสามารถค้นหาข้อมูลได้ตลอดเวลา',
            'article_image' => 'article3.jpg',
        ]);

        Article::create([
            'article_name' => 'เครื่องอ่านไมโครชิพ Reader',
            'article_content' => 'เครื่องอ่านไมโครชิป ใช้สำหรับอ่านเลขไมโครชิปที่เราจะฝัง หรือ ทำการฝังไปแล้วประกอบการฝังด้วยทุกครั้งว่ารหัสไมโครชิปนั้นถูกต้อง ด้วยคุณสมบัติของตัวเครื่องนั้นมีความแม่นยำในการอ่านสูง ตัวเครื่องมีขนาดเล็ก พกพาสะดวก และ ใช้งานได้อย่างง่ายดาย รวมถึงมาตรฐานที่ได้ผ่านการรับรองจาก CE, ROHS เป็นที่เรียบร้อยแล้วอีกด้วย ในส่วนของอุปกรณ์นั้น ก็สามารถใช้งานได้อย่างง่ายดาย ไม่ยุ่งยาก เนื่องจากตัวเครื่องใช้พลังงานจากการชาตด้วย USB เท่านั้น อีกทั้งยังสามารถอ่านได้ในระยะถึง 13 ซม. และ ใช้สำหรับอ่านไมโครชิปมาตรฐาน ISO 11784/5 FDX-B ได้อย่างเสถียร',
            'article_image' => 'article4.jpg',
        ]);
    }
}
